homework/homework01.tex
% Created 2018-01-17 Wed 09:45
\documentclass{tufte-handout}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\date{17 January 2018}
\title{PHYS 381: Homework 01}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.4.51.2 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\rule{\linewidth}{0.5pt}
\section{Create a provisional directory structure for this course}
\label{sec-1}
\begin{itemize}
\item Open a shell on the cluster, and cd to your home directory.
\item Create a directory called PHYS381 and cd into it.
\item Create a set of subdirectories you think will be useful for
organizing your work in this class this semester. I'm being
deliberately vague here, as I want you to put some thought into how
you might organize your work.
\end{itemize}

\rule{\linewidth}{0.5pt}
\section{Begin project 0: Cheat sheets}
\label{sec-2}
Project 0 for the course is to build a set of cheat sheets for the tools in our toolset. A \emph{cheat sheet} should be a single page (or at most, a single sheet of paper, front and back) summary of the most used/useful commands with information on their syntax and usage.

For a few good examples, see:
\begin{itemize}
\item \url{https://www.datacamp.com/community/data-science-cheatsheets}
\item \url{https://www.git-tower.com/blog/git-cheat-sheet/}
\end{itemize}

We will talk about formatting later. For now, just start collecting the information about the shell. What commands have we used so far? What are some useful command-line arguments, and what do they do? Collect your notes in a text file on the cluster.

\rule{\linewidth}{0.5pt}
\section{Work through sections 4,5,6 in the Software Carpentry lesson, bring questions for Friday's class}
\label{sec-3}
Our tour of the shell is based on a set of lessons from Software Carpentry (\url{https://software-carpentry.org/lessons/}), and the zip file you copied into your home directory on the first day contains the sample data from those lessons. Work through sections 4 (Pipes and Filters), 5 (Loops), and 6 (Shell scripts) on your own, and bring questions to Friday's class.
% Emacs 24.4.51.2 (Org mode 8.2.10)
\end{document}